chinadeyou/stm32F10x/example/stm32_i2c_ee.c
/**
  ******************************************************************************
  * @file    stm32_i2c_ee.c
  * @author  MCD Application Team
  * @version V4.5.0
  * @date    07-March-2011
  * @brief   stm32官方例程，硬件I2C访问M24CXX EEPROM。 
  *          
  *          It implements a high level communication layer for read and write 
  *          from/to this memory. The needed STM32 hardware resources (I2C and 
  *          GPIO) are defined in stm32_i2c.h file, and the initialization is 
  *          performed in sEE_LowLevel_Init() function declared in stm32_i2c.c 
  *          file.
  *          You can easily tailor this driver to any other development board, 
  *          by just adapting the defines for hardware resources and 
  *          sEE_LowLevel_Init() function. 
  *        
  *          @note In this driver, basic read and write functions (sEE_ReadBuffer() 
  *                and sEE_WritePage()) use the DMA to perform the data transfer 
  *                to/from EEPROM memory (except when number of requested data is
  *                equal to 1). Thus, after calling these two functions, user 
  *                application may perform other tasks while DMA is transferring
  *                data. The application should then monitor the variable holding 
  *                the number of data in order to determine when the transfer is
  *                completed (variable decremented to 0). Stopping transfer tasks
  *                are performed into DMA interrupt handlers (which are integrated
  *                into this driver).
  *
  ******************************************************************************
  * @attention
  *
  ******************************************************************************  
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32_i2c_ee.h"

__IO uint16_t  sEEAddress = 0;   
__IO uint32_t  sEETimeout = sEE_LONG_TIMEOUT;   
__IO uint16_t* sEEDataReadPointer;   
__IO uint8_t*  sEEDataWritePointer;  
__IO uint8_t   sEEDataNum;


/**
  * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_DeInit(void)
{
	sEE_LowLevel_DeInit(); 
}

/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_Init(void)
{ 
	I2C_InitTypeDef  I2C_InitStructure;
	
	sEE_LowLevel_Init();
	
	/*!< I2C configuration */
	/* sEE_I2C configuration */
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_OwnAddress1 = I2C_SLAVE_ADDRESS7;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
	
	/* sEE_I2C Peripheral Enable */
	I2C_Cmd(sEE_I2C, ENABLE);
	/* Apply sEE_I2C configuration after enabling it */
	I2C_Init(sEE_I2C, &I2C_InitStructure);
	
	/* Enable the sEE_I2C peripheral DMA requests */
	I2C_DMACmd(sEE_I2C, ENABLE);
  
#if defined (sEE_M24C64_32)
	/*!< Select the EEPROM address according to the state of E0, E1, E2 pins */
	sEEAddress = sEE_HW_ADDRESS;  
#elif defined (sEE_M24C08)
	/*!< depending on the sEE Address selected in the i2c_ee.h file */
	#ifdef sEE_Block0_ADDRESS
	/*!< Select the sEE Block0 to write on */
	sEEAddress = sEE_Block0_ADDRESS;
	#endif
  
	#ifdef sEE_Block1_ADDRESS
		/*!< Select the sEE Block1 to write on */
		sEEAddress = sEE_Block1_ADDRESS;
	#endif

	#ifdef sEE_Block2_ADDRESS
		/*!< Select the sEE Block2 to write on */
		sEEAddress = sEE_Block2_ADDRESS;
	#endif
	  
	#ifdef sEE_Block3_ADDRESS
		/*!< Select the sEE Block3 to write on */
		sEEAddress = sEE_Block3_ADDRESS;
	#endif 
#endif /*!< sEE_M24C64_32 */    
}

/**
  * @brief  Reads a block of data from the EEPROM.
  * @param  pBuffer : pointer to the buffer that receives the data read from 
  *         the EEPROM.
  * @param  ReadAddr : EEPROM's internal address to start reading from.
  * @param  NumByteToRead : pointer to the variable holding number of bytes to 
  *         be read from the EEPROM.
  * 
  *        @note The variable pointed by NumByteToRead is reset to 0 when all the 
  *              data are read from the EEPROM. Application should monitor this 
  *              variable in order know when the transfer is complete.
  * 
  * @note When number of data to be read is higher than 1, this function just 
  *       configures the communication and enable the DMA channel to transfer data.
  *       Meanwhile, the user application may perform other tasks.
  *       When number of data to be read is 1, then the DMA is not used. The byte
  *       is read in polling mode.
  * 
  * @retval sEE_OK (0) if operation is correctly performed, else return value 
  *         different from sEE_OK (0) or the timeout user callback.
  */
uint32_t sEE_ReadBuffer(uint8_t* pBuffer, uint16_t ReadAddr, uint16_t* NumByteToRead)
{  
	/* Set the pointer to the Number of data to be read. This pointer will be used 
	  by the DMA Transfer Completer interrupt Handler in order to reset the 
	  variable to 0. User should check on this variable in order to know if the 
	  DMA transfer has been complete or not. */
	sEEDataReadPointer = NumByteToRead;

	/*!< While the bus is busy */
	sEETimeout = sEE_LONG_TIMEOUT;
	while(I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY))
	{
		if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
	}
  
	/*!< Send START condition */
	I2C_GenerateSTART(sEE_I2C, ENABLE);

	/*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
	sEETimeout = sEE_FLAG_TIMEOUT;
	while(!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT))
	{
		if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
	}
  
	/*!< Send EEPROM address for write */
	I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter);

	/*!< Test on EV6 and clear it */
	sEETimeout = sEE_FLAG_TIMEOUT;
	while(!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
	{
		if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
	} 

#ifdef sEE_M24C08  
  
