chinadeyou/stm32F10x/example/stm32_i2c_ee.c
	/*!< While the bus is busy */
	sEETimeout = sEE_LONG_TIMEOUT;
	while(I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY))
	{
		if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
	}

	/* Keep looping till the slave acknowledge his address or maximum number 
	 of trials is reached (this number is defined by sEE_MAX_TRIALS_NUMBER define
	 in stm32_eval_i2c_ee.h file) */
	while (1)
	{
		/*!< Send START condition */
		I2C_GenerateSTART(sEE_I2C, ENABLE);

		/*!< Test on EV5 and clear it */
		sEETimeout = sEE_FLAG_TIMEOUT;
		while(!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT))
		{
			if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
		}    

		/*!< Send EEPROM address for write */
		I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter);

		/* Wait for ADDR flag to be set (Slave acknowledged his address) */
		sEETimeout = sEE_LONG_TIMEOUT;
		do
		{     
			/* Get the current value of the SR1 register */
			tmpSR1 = sEE_I2C->SR1;

			/* Update the timeout value and exit if it reach 0 */
			if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
		}
		/* Keep looping till the Address is acknowledged or the AF flag is 
		   set (address not acknowledged at time) */
		while((tmpSR1 & (I2C_SR1_ADDR | I2C_SR1_AF)) == 0);
		 
		/* Check if the ADDR flag has been set */
		if (tmpSR1 & I2C_SR1_ADDR)
		{
			/* Clear ADDR Flag by reading SR1 then SR2 registers (SR1 have already 
			 been read) */
			(void)sEE_I2C->SR2;

			/*!< STOP condition */    
			I2C_GenerateSTOP(sEE_I2C, ENABLE);

			/* Exit the function */
			return sEE_OK;
		}
		else
		{
			/*!< Clear AF flag */
			I2C_ClearFlag(sEE_I2C, I2C_FLAG_AF);                  
		}

		/* Check if the maximum allowed numbe of trials has bee reached */
		if (sEETrials++ == sEE_MAX_TRIALS_NUMBER)
		{
			/* If the maximum number of trials has been reached, exit the function */
			return sEE_TIMEOUT_UserCallback();
		}
	}
}

/**
  * @brief  This function handles the DMA Tx Channel interrupt Handler.
  * @param  None
  * @retval None
  */
void sEE_I2C_DMA_TX_IRQHandler(void)
{
	/* Check if the DMA transfer is complete */ 
	if(DMA_GetFlagStatus(sEE_I2C_DMA_FLAG_TX_TC) != RESET)
	{  
		/* Disable the DMA Tx Channel and Clear all its Flags */  
		DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX, DISABLE);
		DMA_ClearFlag(sEE_I2C_DMA_FLAG_TX_GL);

		/*!< Wait till all data have been physically transferred on the bus */
		sEETimeout = sEE_LONG_TIMEOUT;
		while(!I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BTF))
		{
			if((sEETimeout--) == 0) sEE_TIMEOUT_UserCallback();
		}

		/*!< Send STOP condition */
		I2C_GenerateSTOP(sEE_I2C, ENABLE);

		/* Perform a read on SR1 and SR2 register to clear eventualaly pending flags */
		(void)sEE_I2C->SR1;
		(void)sEE_I2C->SR2;

		/* Reset the variable holding the number of data to be written */
		*sEEDataWritePointer = 0;  
	}
}

/**
  * @brief  This function handles the DMA Rx Channel interrupt Handler.
  * @param  None
  * @retval None
  */
void sEE_I2C_DMA_RX_IRQHandler(void)
{
	/* Check if the DMA transfer is complete */
	if(DMA_GetFlagStatus(sEE_I2C_DMA_FLAG_RX_TC) != RESET)
	{      
		/*!< Send STOP Condition */
		I2C_GenerateSTOP(sEE_I2C, ENABLE);    

		/* Disable the DMA Rx Channel and Clear all its Flags */  
		DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX, DISABLE);
		DMA_ClearFlag(sEE_I2C_DMA_FLAG_RX_GL);

		/* Reset the variable holding the number of data to be read */
		*sEEDataReadPointer = 0;
	}
}

#ifdef USE_DEFAULT_TIMEOUT_CALLBACK
/**
  * @brief  Basic management of the timeout situation.
  * @param  None.
  * @retval None.
  */
uint32_t sEE_TIMEOUT_UserCallback(void)
{
	/* Block communication and all processes */
	while (1)
	{   
	}
}
#endif /* USE_DEFAULT_TIMEOUT_CALLBACK */

#ifdef USE_DEFAULT_CRITICAL_CALLBACK
/**
  * @brief  Start critical section: these callbacks should be typically used
  *         to disable interrupts when entering a critical section of I2C communication
  *         You may use default callbacks provided into this driver by uncommenting the 
  *         define USE_DEFAULT_CRITICAL_CALLBACK.
  *         Or you can comment that line and implement these callbacks into your 
  *         application.
  * @param  None.
  * @retval None.
  */
void sEE_EnterCriticalSection_UserCallback(void)
{
	__disable_irq();  
}

/**
  * @brief  Start and End of critical section: these callbacks should be typically used
  *         to re-enable interrupts when exiting a critical section of I2C communication
  *         You may use default callbacks provided into this driver by uncommenting the 
  *         define USE_DEFAULT_CRITICAL_CALLBACK.
  *         Or you can comment that line and implement these callbacks into your 
  *         application.
  * @param  None.
  * @retval None.
  */
void sEE_ExitCriticalSection_UserCallback(void)
{
	__enable_irq();
}
#endif /* USE_DEFAULT_CRITICAL_CALLBACK */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */  

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
